app/Controllers/FacilitiesController.php

    public function getAddons()
    {
        try {
            $addons = $this->addonModel->findAll();
---
SELECT *
FROM `addons`

    public function getFacilityGallery($facilityKey = null)
    {
        try {
            if (!$facilityKey) {
                return $this->response->setJSON([
                    'success' => false,
                    'message' => 'Facility key is required'
                ])->setStatusCode(400);
            }

            // Get facility by key
            $facility = $this->facilityModel
                ->where('facility_key', $facilityKey)
                ->first();
---
SELECT *
FROM `facilities`
WHERE `facility_key` = 'pearl-restaurant'
 LIMIT 1