app/Controllers/Home.php

    public function facilityDetail($facilityKey)
    {
        $session = session();

        // Fetch facility from database
        $facility = $this->facilityModel
            ->where('facility_key', $facilityKey)
            ->where('is_active', 1)
            ->first();

        // If facility not found, throw 404 error
        if (!$facility) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Facility not found');
        }

        // Fetch plans for this facility
        $plans = $this->planModel
            ->where('facility_id', $facility['id'])
            ->findAll();
---
SELECT *
FROM `facilities`
WHERE `facility_key` = 'pearl-restaurant'
AND `is_active` = 1
 LIMIT 1
SELECT *
FROM `plans`
WHERE `facility_id` = '6'